In [1]:
import pandas as pd
import numpy as np
import json

In [2]:
import re
from nltk.corpus import stopwords
import string

In [3]:
import nltk

In [4]:
nltk.download('stopwords')

[nltk_data] Downloading package stopwords to
[nltk_data]     /Users/tavishipriyam/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

True

In [5]:
ls

amazon.csv                          rotten_tomatoes_critic_reviews.csv
clean_dataset.csv                   tripadvisor.csv
combined_dataset.csv                twitter.csv
imdb.csv                            yelp.json
project.ipynb

In [6]:
amazon_df = pd.read_csv("amazon.csv")

In [7]:
del amazon_df['Id']
del amazon_df['ProductId']
del amazon_df['UserId']
del amazon_df['ProfileName']
del amazon_df['HelpfulnessNumerator']
del amazon_df['HelpfulnessDenominator']
del amazon_df['Time']
del amazon_df['Summary']

In [8]:
amazon_df.head()

   Score                                               Text
0      5  I have bought several of the Vitality canned d...
1      1  Product arrived labeled as Jumbo Salted Peanut...
2      4  This is a confection that has been around a fe...
3      2  If you are looking for the secret ingredient i...
4      5  Great taffy at a great price.  There was a wid...

In [9]:
amazon_df['Score'] = amazon_df['Score'].replace([5,4,2,1],[1,1,0,0])

In [10]:
amazon_df.head()

   Score                                               Text
0      1  I have bought several of the Vitality canned d...
1      0  Product arrived labeled as Jumbo Salted Peanut...
2      1  This is a confection that has been around a fe...
3      0  If you are looking for the secret ingredient i...
4      1  Great taffy at a great price.  There was a wid...

In [11]:
len(amazon_df)

568454

In [12]:
amazon_df = amazon_df[amazon_df.Score != 3]

In [13]:
len(amazon_df)

525814

In [14]:
amazon_df['Score'].unique()

array([1, 0])

In [15]:
amazon_df = amazon_df[['Text','Score']]

In [16]:
amazon_df.head()

                                                Text  Score
0  I have bought several of the Vitality canned d...      1
1  Product arrived labeled as Jumbo Salted Peanut...      0
2  This is a confection that has been around a fe...      1
3  If you are looking for the secret ingredient i...      0
4  Great taffy at a great price.  There was a wid...      1

In [17]:
twitter_df = pd.read_csv("twitter.csv", header = None)

In [18]:
twitter_df.head()

,0,1,2,3,4,5
0,0,1467810369,Mon Apr 06 22:19:45 PDT 2009,NO_QUERY,_TheSpecialOne_,"@switchfoot http://twitpic.com/2y1zl - Awww, t..."
1,0,1467810672,Mon Apr 06 22:19:49 PDT 2009,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...
2,0,1467810917,Mon Apr 06 22:19:53 PDT 2009,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...
3,0,1467811184,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,ElleCTF,my whole body feels itchy and like its on fire
4,0,1467811193,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,Karoli,"@nationwideclass no, it's not behaving at all...."

In [19]:
twitter_df[0].unique()

array([0, 4])

In [20]:
del twitter_df[1],twitter_df[2],twitter_df[3],twitter_df[4]

In [21]:
twitter_df.head(20)

    0                                                  5
0   0  @switchfoot http://twitpic.com/2y1zl - Awww, t...
1   0  is upset that he can't update his Facebook by ...
2   0  @Kenichan I dived many times for the ball. Man...
3   0    my whole body feels itchy and like its on fire
4   0  @nationwideclass no, it's not behaving at all....
5   0                      @Kwesidei not the whole crew
6   0                                        Need a hug
7   0  @LOLTrish hey  long time no see! Yes.. Rains a...
8   0               @Tatiana_K nope they didn't have it
9   0                          @twittera que me muera ?
10  0        spring break in plain city... it's snowing
11  0                         I just re-pierced my ears
12  0  @caregiving I couldn't bear to watch it.  And ...
13  0  @octolinz16 It it counts, idk why I did either...
14  0  @smarrison i would've been the first, but i di...
15  0  @iamjazzyfizzle I wish I got to watch it with ...
16  0  Hollis' death scene will hurt me severely to w...
17  0                               about to file taxes
18  0  @LettyA ahh ive always wanted to see rent  lov...
19  0  @FakerPattyPattz Oh dear. Were you drinking ou...

In [22]:
twitter_df[0] = twitter_df[0].replace(4,1)

In [23]:
twitter_df[0].unique()

array([0, 1])

In [24]:
twitter_df = twitter_df[[5,0]]

In [25]:
twitter_df

                                                         5  0
0        @switchfoot http://twitpic.com/2y1zl - Awww, t...  0
1        is upset that he can't update his Facebook by ...  0
2        @Kenichan I dived many times for the ball. Man...  0
3          my whole body feels itchy and like its on fire   0
4        @nationwideclass no, it's not behaving at all....  0
...                                                    ... ..
1599995  Just woke up. Having no school is the best fee...  1
1599996  TheWDB.com - Very cool to hear old Walt interv...  1
1599997  Are you ready for your MoJo Makeover? Ask me f...  1
1599998  Happy 38th Birthday to my boo of alll time!!! ...  1
1599999  happy #charitytuesday @theNSPCC @SparksCharity...  1

[1600000 rows x 2 columns]

In [26]:
ta_df = pd.read_csv("tripadvisor.csv")

In [27]:
ta_df.head()

                                              Review  Rating
0  nice hotel expensive parking got good deal sta...       4
1  ok nothing special charge diamond member hilto...       2
2  nice rooms not 4* experience hotel monaco seat...       3
3  unique, great stay, wonderful time hotel monac...       5
4  great stay great stay, went seahawk game aweso...       5

In [28]:
ta_df['Rating'].unique()

array([4, 2, 3, 5, 1])

In [29]:
len(ta_df)

20491

In [30]:
ta_df['Rating'] = ta_df['Rating'].replace([5,4,2,1],[1,1,0,0])

In [31]:
ta_df.head()

                                              Review  Rating
0  nice hotel expensive parking got good deal sta...       1
1  ok nothing special charge diamond member hilto...       0
2  nice rooms not 4* experience hotel monaco seat...       3
3  unique, great stay, wonderful time hotel monac...       1
4  great stay great stay, went seahawk game aweso...       1

In [32]:
ta_df = ta_df[ta_df.Rating != 3]

In [33]:
ta_df.head()

                                              Review  Rating
0  nice hotel expensive parking got good deal sta...       1
1  ok nothing special charge diamond member hilto...       0
3  unique, great stay, wonderful time hotel monac...       1
4  great stay great stay, went seahawk game aweso...       1
5  love monaco staff husband stayed hotel crazy w...       1

In [34]:
len(ta_df)

18307

In [35]:
imdb_df = pd.read_csv("imdb.csv")

In [36]:
len(imdb_df)

50000

In [37]:
imdb_df.head()

                                              review sentiment
0  One of the other reviewers has mentioned that ...  positive
1  A wonderful little production. <br /><br />The...  positive
2  I thought this was a wonderful way to spend ti...  positive
3  Basically there's a family where a little boy ...  negative
4  Petter Mattei's "Love in the Time of Money" is...  positive

In [38]:
imdb_df['sentiment'].unique()

array(['positive', 'negative'], dtype=object)

In [39]:
imdb_df['sentiment'] = imdb_df['sentiment'].replace(['positive','negative'],[1,0])

In [40]:
imdb_df.head()

                                              review  sentiment
0  One of the other reviewers has mentioned that ...          1
1  A wonderful little production. <br /><br />The...          1
2  I thought this was a wonderful way to spend ti...          1
3  Basically there's a family where a little boy ...          0
4  Petter Mattei's "Love in the Time of Money" is...          1

In [41]:
twitter_df.rename(columns={5: 'Text', 0: 'Score'}, inplace=True)

In [42]:
twitter_df

                                                      Text  Score
0        @switchfoot http://twitpic.com/2y1zl - Awww, t...      0
1        is upset that he can't update his Facebook by ...      0
2        @Kenichan I dived many times for the ball. Man...      0
3          my whole body feels itchy and like its on fire       0
4        @nationwideclass no, it's not behaving at all....      0
...                                                    ...    ...
1599995  Just woke up. Having no school is the best fee...      1
1599996  TheWDB.com - Very cool to hear old Walt interv...      1
1599997  Are you ready for your MoJo Makeover? Ask me f...      1
1599998  Happy 38th Birthday to my boo of alll time!!! ...      1
1599999  happy #charitytuesday @theNSPCC @SparksCharity...      1

[1600000 rows x 2 columns]

In [43]:
twitter_sampled_df = twitter_df.sample(frac = .1)

In [44]:
twitter_sampled_df

                                                      Text  Score
369646   Made it to the end of the week, but not the en...      0
188770   @foiledcupcakes I just moved back north to Des...      0
697712            is bored as andre is playing on the wii       0
582491   &quot;Other half&quot; had to choose tonight t...      0
400049                  i wanna go to my cousin's houseee       0
...                                                    ...    ...
1424385  @metrostation sheez.good luck guys i love you ...      1
1172388        @grahamblanca Aha, thank you so very much.       1
492884                                      @Haligrl nope       0
401735                    i wish i would have a blackbery       0
61266    @maryangel200 *cliiiiings* I hope your surgery...      0

[160000 rows x 2 columns]

In [45]:
amazon_df

                                                     Text  Score
0       I have bought several of the Vitality canned d...      1
1       Product arrived labeled as Jumbo Salted Peanut...      0
2       This is a confection that has been around a fe...      1
3       If you are looking for the secret ingredient i...      0
4       Great taffy at a great price.  There was a wid...      1
...                                                   ...    ...
568449  Great for sesame chicken..this is a good if no...      1
568450  I'm disappointed with the flavor. The chocolat...      0
568451  These stars are small, so you can give 10-15 o...      1
568452  These are the BEST treats for training and rew...      1
568453  I am very satisfied ,product is as advertised,...      1

[525814 rows x 2 columns]

In [46]:
amazon_sampled_df = amazon_df.sample(frac = .25)

In [47]:
amazon_sampled_df

                                                     Text  Score
476225  I first tried this as a gift from a co-worker....      1
196212  If you use a lot of this item, you can save so...      1
172815  We drink this for the probiotics, but we usual...      1
549944  Pacific Natural Foods Hemp Milk is one of the ...      1
104420  These chips are awesome! All natural (even the...      1
...                                                   ...    ...
201505  I was excited to find a pasta meal with spicy ...      1
383097  I love Haribo!!!!  In my opinion gummy bears s...      1
4315    Ok--I just bought BIsquick GF and the first th...      1
22315   My puppy is a very picky eater, which makes it...      1
342550  Wasn't crazy about the taste initially, but no...      1

[131454 rows x 2 columns]

In [48]:
imdb_df.rename(columns={'review': 'Text', 'sentiment': 'Score'}, inplace=True)

In [49]:
imdb_df

                                                    Text  Score
0      One of the other reviewers has mentioned that ...      1
1      A wonderful little production. <br /><br />The...      1
2      I thought this was a wonderful way to spend ti...      1
3      Basically there's a family where a little boy ...      0
4      Petter Mattei's "Love in the Time of Money" is...      1
...                                                  ...    ...
49995  I thought this movie did a down right good job...      1
49996  Bad plot, bad dialogue, bad acting, idiotic di...      0
49997  I am a Catholic taught in parochial elementary...      0
49998  I'm going to have to disagree with the previou...      0
49999  No one expects the Star Trek movies to be high...      0

[50000 rows x 2 columns]

In [50]:
ta_df.rename(columns = {'Review': 'Text', 'Rating': 'Score'}, inplace = True)

In [51]:
ta_df

                                                    Text  Score
0      nice hotel expensive parking got good deal sta...      1
1      ok nothing special charge diamond member hilto...      0
3      unique, great stay, wonderful time hotel monac...      1
4      great stay great stay, went seahawk game aweso...      1
5      love monaco staff husband stayed hotel crazy w...      1
...                                                  ...    ...
20486  best kept secret 3rd time staying charm, not 5...      1
20487  great location price view hotel great quick pl...      1
20488  ok just looks nice modern outside, desk staff ...      0
20489  hotel theft ruined vacation hotel opened sept ...      0
20490  people talking, ca n't believe excellent ratin...      0

[18307 rows x 2 columns]

In [52]:
frames = [amazon_sampled_df, twitter_sampled_df, ta_df, imdb_df]

In [53]:
df = pd.concat(frames)

In [54]:
df

                                                     Text  Score
476225  I first tried this as a gift from a co-worker....      1
196212  If you use a lot of this item, you can save so...      1
172815  We drink this for the probiotics, but we usual...      1
549944  Pacific Natural Foods Hemp Milk is one of the ...      1
104420  These chips are awesome! All natural (even the...      1
...                                                   ...    ...
49995   I thought this movie did a down right good job...      1
49996   Bad plot, bad dialogue, bad acting, idiotic di...      0
49997   I am a Catholic taught in parochial elementary...      0
49998   I'm going to have to disagree with the previou...      0
49999   No one expects the Star Trek movies to be high...      0

[359761 rows x 2 columns]

In [136]:
df.to_csv("combined_dataset.csv")

In [5]:
df = pd.read_csv("test_data_clean.csv")

In [6]:
def clean_text(text):
    url_pattern = re.compile(r'https?://\S+|www\.\S+')
    text = url_pattern.sub(r'', text)
    text = re.sub('\S*@\S*\s?', '', text)
    text = re.sub('\s+', ' ', text)
    text = re.sub("\'", "", text)
    tokens = text.split()
    table = str.maketrans('', '', string.punctuation)
    tokens = [w.translate(table) for w in tokens]
    tokens = [word for word in tokens if word.isalpha()]
    stop_words = set(stopwords.words('english'))
    tokens = [w for w in tokens if not w in stop_words]
    tokens = [word for word in tokens if len(word) > 1]
    
    return tokens

In [56]:
ls_amazon = []

In [57]:
for i in amazon_sampled_df['Text']:
    ls_amazon.append(clean_text(i))

In [58]:
len(ls_amazon)

131454

In [59]:
len(amazon_sampled_df)

131454

In [60]:
amazon_sampled_df['CleanText'] = ls_amazon

In [61]:
amazon_sampled_df.head()

,Text,Score,CleanText
476225,I first tried this as a gift from a co-worker....,1,"[first, tried, gift, coworker, like, natural, ..."
196212,"If you use a lot of this item, you can save so...",1,"[If, use, lot, item, save, real, money, Box, t..."
172815,"We drink this for the probiotics, but we usual...",1,"[We, drink, probiotics, usually, add, protein,..."
549944,Pacific Natural Foods Hemp Milk is one of the ...,1,"[Pacific, Natural, Foods, Hemp, Milk, one, hea..."
104420,These chips are awesome! All natural (even the...,1,"[These, chips, awesome, All, natural, even, co..."

In [62]:
amazon_sampled_df.to_csv("amazon_clean.csv")

In [63]:
ls_t = []

In [64]:
for i in twitter_sampled_df['Text']:
    ls_t.append(clean_text(i))

In [65]:
len(ls_t)

160000

In [66]:
len(twitter_sampled_df)

160000

In [67]:
twitter_sampled_df['CleanText'] = ls_t

In [68]:
twitter_sampled_df.head()

,Text,Score,CleanText
369646,"Made it to the end of the week, but not the en...",0,"[Made, end, week, end, work, Have, go, weekend..."
188770,@foiledcupcakes I just moved back north to Des...,0,"[moved, back, north, Des, Plaines, hope, wonde..."
697712,is bored as andre is playing on the wii,0,"[bored, andre, playing, wii]"
582491,&quot;Other half&quot; had to choose tonight t...,0,"[quotOther, halfquot, choose, tonight, check, ..."
400049,i wanna go to my cousin's houseee,0,"[wanna, go, cousins, houseee]"

In [69]:
twitter_sampled_df.to_csv("twitter_clean.csv")

In [70]:
ls_ta = []

In [71]:
for i in ta_df['Text']:
    ls_ta.append(clean_text(i))

In [72]:
len(ls_ta)

18307

In [73]:
len(ta_df)

18307

In [74]:
ta_df['CleanText'] = ls_ta

In [75]:
ta_df.head()

,Text,Score,CleanText
0,nice hotel expensive parking got good deal sta...,1,"[nice, hotel, expensive, parking, got, good, d..."
1,ok nothing special charge diamond member hilto...,0,"[ok, nothing, special, charge, diamond, member..."
3,"unique, great stay, wonderful time hotel monac...",1,"[unique, great, stay, wonderful, time, hotel, ..."
4,"great stay great stay, went seahawk game aweso...",1,"[great, stay, great, stay, went, seahawk, game..."
5,love monaco staff husband stayed hotel crazy w...,1,"[love, monaco, staff, husband, stayed, hotel, ..."

In [76]:
ta_df.to_csv("ta_clean.csv")

In [77]:
ls_imdb = []

In [78]:
for i in imdb_df['Text']:
    ls_imdb.append(clean_text(i))

In [79]:
len(ls_imdb)

50000

In [80]:
len(imdb_df)

50000

In [81]:
imdb_df['CleanText'] = ls_imdb

In [82]:
imdb_df.head()

,Text,Score,CleanText
0,One of the other reviewers has mentioned that ...,1,"[One, reviewers, mentioned, watching, Oz, epis..."
1,A wonderful little production. <br /><br />The...,1,"[wonderful, little, production, br, br, The, f..."
2,I thought this was a wonderful way to spend ti...,1,"[thought, wonderful, way, spend, time, hot, su..."
3,Basically there's a family where a little boy ...,0,"[Basically, theres, family, little, boy, Jake,..."
4,"Petter Mattei's ""Love in the Time of Money"" is...",1,"[Petter, Matteis, Love, Time, Money, visually,..."

In [83]:
imdb_df.to_csv("imdb_clean.csv")

In [142]:
len(newls)

359761

In [143]:
len(df)

359761

In [144]:
df['CleanText'] = newls

In [145]:
df.sample(frac=1)

,Text,Score,CleanText
1088019,"Home Sweet Home, from a memorial day, I promis...",1,"[Home, Sweet, Home, memorial, day, promise, co..."
20206,SPOILERS THROUGHOUT!!!!<br /><br />I had read ...,0,"[SPOILERS, THROUGHOUTbr, br, read, book, die, ..."
184555,My cat could not wait to eat some of this food...,1,"[My, cat, could, wait, eat, food, She, really,..."
518238,The Stash Tea Company seems to make excellent ...,1,"[The, Stash, Tea, Company, seems, make, excell..."
129980,I would recommend this tea for anyone who enjo...,1,"[would, recommend, tea, anyone, enjoys, good, ..."
...,...,...,...
284200,Its hard to get our niece to eat much when she...,1,"[Its, hard, get, niece, eat, much, shes, house..."
282049,"I have hair that is thick and goes about 3"" pa...",1,"[hair, thick, goes, past, shoulders, difficult..."
25791,There's really no way to beat around the bush ...,0,"[Theres, really, way, beat, around, bush, sayi..."
469592,"Great taste, which I appreciate being diabetic...",1,"[Great, taste, appreciate, diabetic, sweet, wo..."
870345,awake wayy too early. dang bamboozle!!! cya @...,1,"[awake, wayy, early, dang, bamboozle, cya, bea..."

In [138]:
df.head()

                                                     Text  Score
76007   These great little candies are quite addictive...      1
368315  I bought this and thought it was a good deal.....      0
450447  The Red Caviar is very fresh and melts in my m...      1
463208  I came back to see if these were still availab...      1
178408  I love this Black Truffle sea salt!  I purchas...      1

In [146]:
df.to_csv("clean_dataset.csv")

In [4]:
df = pd.read_csv("clean_dataset.csv")